-- 第0話「きっかけ」

-- ワシはおじいちゃん. 仕事も辞めたが, 生き甲斐がある.
-- 学「おじいちゃん!」
-- それは, ワシの可愛い孫だ. 名前は学(まなぶ).
-- 学「わからないことがあるけど, 聞いていい?」
-- ワシ「いいぞ.」
-- 学は, ワシが何でも知っていると思っている. 期待に答えて頑張るぞ.
-- 鳥の名前かな? 明日の天気かな?

-- 学「最近, 学校で, Lean4が流行っているけど, どんなものかわからなくて.
--    おじいちゃんは知っている?」
-- ワシ「...」
-- 学「Wikiだと『Leanは純粋関数型プログラミング言語のひとつである.
--    また, 同時に証明支援系でもある.』とあるけど, さっぱりわからない.」
-- ワシ「えっと...」
-- 学「そっか, 最近, Lean4の話で周りに馴染めなくて.
--     でも, おじいちゃんもできないことあるよね. ごめんね.」
-- 学のこんな顔見てられん.
-- ワシ「知っているぞ.」
-- 学「本当! 明日PC持ってくるね.」
-- 大変なことになった. ワシは必死で勉強することになりそうだ.

-- おじいちゃんのひとりごと
-- 最近物覚えが悪く, 記憶力もひどいです.
-- それと, 参考にしたサイトは沢山あり, 極力参考サイトを書きますが, 抜けているかもです.
-- それと, たまに嘘もつきます. 年寄りだから許して.
